# Выведите число сочетаний C(n,k).
#
# Формат ввода
# В первой строке находится два числа (1≤n≤7), (1≤k≤7).
#
# Формат вывода
# Выведите ответ на задачу.
#
# Пример 1    | Пример 2    |   Пример 3
# Ввод 3 2    | Ввод 7 5    |   Ввод 1 1
# Вывод 3     | Вывод 21    |   Вывод 1

# ------------------------------------------------
#                    1 METHOD
# ------------------------------------------------

def C(n, k):
    if k == 0:
        return 1
    elif k > n:
        return 0
    else:
        return C(n - 1, k) + C(n - 1, k - 1)

n, k = map(int, input().split())
print(C(n, k))
# ------------------------------------------------
#                    2 METHOD
# ------------------------------------------------
import math

n = int(input())
k = int(input())
print(math.comb(n, k))